#include <stdio.h>// Определить константу N равной 10, которая представляет размер массива
#define N 10

int main( void )
{
    // Определить массив x, содержащий N целых чисел для хранения входных целых чисел
    int x[N];
    int min = 0;
    int max = 0;
    int i;// 输入数组
    // С помощью цикла for считывать N целых чисел из стандартного ввода и последовательно хранить их в массиве x
    for( i = 0; i < N; i++ )
    {
        scanf("%d", &x[i]);
    }
    for( i = 1; i < N; i++ )
    {
        if (x[i] < x[min])
            min = i;// 如果当前元素大于当前记录的最大元素
        if (x[i] > x[max])// 更新最大元素的索引为当前元素的索引
            max = i;
    }
    if(max>min)
{
     for (i = min + 1; i < max; i++)// 将该范围内的元素置为 0
        x[i] = 0;
}
    else
    {
        for (i = max + 1; i < min; i++)// 将该范围内的元素置为 0
        x[i] = 0;
    }// 输出数组
    // 通过 for 循环遍历数组，依次输出每个元素，元素之间用空格分隔
    for( i = 0; i < N; i++ )
        printf("%d ", x[i]);
 printf("\n");

    return 0;
}
