#include <stdio.h>
// §à§á§â§Ö§Õ§Ö§Ý§Ö§ß§Ú§Ö §ã§Ú§Þ§Ó§à§Ý§Ú§é§Ö§ã§Ü§Ú§ç §Ü§à§ß§ã§ä§Ñ§ß§ä
#define YES  1
#define NO   0

int main( void )
{
 int c;  // §ä§Ö§Ü§å§ë§Ú§Û §ã§Ú§Þ§Ó§à§Ý §Ú§Ù §á§à§ä§à§Ü§Ñ

 int flag; // §á§â§Ú§Ù§ß§Ñ§Ü §ã§Ý§à§Ó§Ñ
 int cnt;  // §ã§é§×§ä§é§Ú§Ü
 int found; // §Ú§ß§Õ§Ú§Ü§Ñ§ä§à§â §ä§à§Ô§à, §é§ä§à §Ú§ã§Ü§à§Þ§í§Û §á§â§Ú§Ù§ß§Ñ§Ü
    // §à§Ò§ß§Ñ§â§å§Ø§Ö§ß

 // §ß§Ñ§é§Ñ§Ý§î§ß§í§Ö §á§â§Ú§ã§Ó§Ñ§Ú§Ó§Ñ§ß§Ú§ñ (§Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ñ§è§Ú§ñ)
 cnt = 0;
 flag = NO;
 found = NO;


 // §è§Ú§Ü§Ý §é§ä§Ö§ß§Ú§ñ §ã§Ú§Þ§Ó§à§Ý§à§Ó §Ú§Ù §á§à§ä§à§Ü§Ñ, §ã§Ó§ñ§Ù§Ñ§ß§ß§à§Ô§à §ã
 // §Ü§Ý§Ñ§Ó§Ú§Ñ§ä§å§â§à§Û
 while( (c = getchar()) != EOF )
 {
  if( c == ' ' || c == '.' || c == '\n' ||
   c == ',' )
  {
   // §ß§Ñ§Û§Õ§Ö§ß §â§Ñ§Ù§Õ§Ö§Ý§Ú§ä§Ö§Ý§î
   if( flag && found )
   {
    cnt = cnt + 1;
    }

   flag = NO;
   found=NO;
  }
  else
  {
   // §ß§Ñ§Û§Õ§Ö§ß§Ñ §Ò§å§Ü§Ó§Ñ

   // §á§â§à§Ó§Ö§â§Ü§Ñ §ã§à§Ó§á§Ñ§Õ§Ö§ß§Ú§ñ §ä§Ö§Ü§å§ë§Ö§Ô§à §Ú
   // §á§â§Ö§Õ§í§Õ§å§ë§Ö§Ô§à §ã§Ú§Þ§Ó§à§Ý§à§Ó
    flag = YES;
   if( c == 'a' )
   {
       found = YES;
   }

    }
  }
 if (flag && found)
    {
        cnt++;
    }

 printf("number of words = %d\n", cnt );
    return 0;
}
